namespace WFw.GeTui.Models.Push
{


    /// <summary>
    /// 设置通知渠道重要性（可以控制响铃，震动，浮动，闪灯等等）
    /// android8.0以下
    /// 0，1，2:无声音，无振动，不浮动
    /// 3:有声音，无振动，不浮动
    /// 4:有声音，有振动，有浮动
    /// android8.0以上
    /// 0：无声音，无振动，不显示；
    /// 1：无声音，无振动，锁屏不显示，通知栏中被折叠显示，导航栏无logo;
    /// 2：无声音，无振动，锁屏和通知栏中都显示，通知不唤醒屏幕;
    /// 3：有声音，无振动，锁屏和通知栏中都显示，通知唤醒屏幕;
    /// 4：有声音，有振动，亮屏下通知悬浮展示，锁屏通知以默认形式展示且唤醒屏幕;                                                                                                                                               
    public enum ChannelLevel
    {
        /// <summary>
        /// android8.0以下
        /// 无声音，无振动，不浮动
        /// android8.0以上
        /// 无声音，无振动，不显示；
        /// </summary>
        None = 0,

        /// <summary>
        /// android8.0以下
        /// 无声音，无振动，不浮动
        /// android8.0以上
        /// 无声音，无振动，锁屏不显示，通知栏中被折叠显示，导航栏无logo;
        /// </summary>
        Minimum = 1,

        /// <summary>
        /// /// <summary>
        /// android8.0以下
        /// 无声音，无振动，不浮动
        /// android8.0以上
        /// 无声音，无振动，锁屏和通知栏中都显示，通知不唤醒屏幕;
        /// </summary>
        /// </summary>
        Low = 2,
        /// <summary>
        /// android8.0以下
        /// 有声音，有振动，有浮动
        /// android8.0以上
        /// 有声音，无振动，锁屏和通知栏中都显示，通知唤醒屏幕;
        /// </summary>
        Default = 3,
        /// <summary>
        /// android8.0以下
        /// 有声音，无振动，不浮动
        /// android8.0以上
        /// 有声音，有振动，亮屏下通知悬浮展示，锁屏通知以默认形式展示且唤醒屏幕;   
        /// </summary>
        Highest = 4
    }

}


